In [3]:
import pandas as pd
import numpy as np

### 7. grouping

In [4]:
df = pd.DataFrame(
    {
        'A' : ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
        'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
        'C' : np.random.randn(8),
        'D' : np.random.randn(8)
    })

In [7]:
df

     A      B         C         D
0  foo    one -0.302310  0.054691
1  bar    one  1.010874 -1.953055
2  foo    two  0.127743  1.377715
3  bar  three  0.363686  0.138757
4  foo    two -0.652340 -0.601223
5  bar    two -0.288872  0.847224
6  foo    one -0.949880 -0.730096
7  foo  three -1.150245  1.475530

In [11]:
df.groupby('B').sum()

              C         D
B
one   -0.241316 -2.628460
three -0.786560  1.614287
two   -0.813469  1.623715

In [12]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    1.010874 -1.953055
    three  0.363686  0.138757
    two   -0.288872  0.847224
foo one   -1.252190 -0.675405
    three -1.150245  1.475530
    two   -0.524597  0.776491

In [13]:
df.groupby(['B','A']).sum()

                  C         D
B     A
one   bar  1.010874 -1.953055
      foo -1.252190 -0.675405
three bar  0.363686  0.138757
      foo -1.150245  1.475530
two   bar -0.288872  0.847224
      foo -0.524597  0.776491

### 8. reshaping

In [14]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                     'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two',
                     'one', 'two', 'one', 'two']]))

In [15]:
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [16]:
index = pd.MultiIndex.from_tuples(tuples, names=['1st', '2nd'])

In [17]:
index

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['1st', '2nd'])

In [18]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [19]:
df

                A         B
1st 2nd
bar one -0.160324  1.786535
    two -0.005162  1.155922
baz one -0.134352  0.502285
    two -0.079072  0.091560
foo one -1.030142 -0.535125
    two  1.262896 -0.347525
qux one  1.440906  1.603468
    two -1.380828  0.974759

In [20]:
df2  =  df[:4]

In [21]:
df2

                A         B
1st 2nd
bar one -0.160324  1.786535
    two -0.005162  1.155922
baz one -0.134352  0.502285
    two -0.079072  0.091560

In [22]:
stacked = df2.stack()

In [23]:
stacked # 행을 늘려놨음

1st  2nd
bar  one  A   -0.160324
          B    1.786535
     two  A   -0.005162
          B    1.155922
baz  one  A   -0.134352
          B    0.502285
     two  A   -0.079072
          B    0.091560
dtype: float64

In [28]:
stacked.unstack(0)

1st         bar       baz
2nd
one A -0.160324 -0.134352
    B  1.786535  0.502285
two A -0.005162 -0.079072
    B  1.155922  0.091560

### pivot table

In [29]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                   'B' : ['A', 'B', 'C'] * 4,
                   'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D' : np.random.randn(12),
                   'E' : np.random.randn(12)})

In [30]:
df

        A  B    C         D         E
0     one  A  foo  0.357469 -0.409212
1     one  B  foo  0.371796  0.462735
2     two  C  foo  0.660894  0.912108
3   three  A  bar  1.345603  1.354333
4     one  B  bar -0.068768 -0.025743
5     one  C  bar -0.923342  0.997041
6     two  A  foo -1.085876 -1.269232
7   three  B  foo  1.155175 -0.482582
8     one  C  foo  1.113235  0.817518
9     one  A  bar  0.618860 -0.386848
10    two  B  bar -0.624639 -0.567212
11  three  C  bar -0.354034  1.092863

In [31]:
df.groupby('A').sum()

              D         E
A
one    1.469249  1.455491
three  2.146744  1.964614
two   -1.049620 -0.924336

In [32]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  0.618860  0.357469
      B -0.068768  0.371796
      C -0.923342  1.113235
three A  1.345603       NaN
      B       NaN  1.155175
      C -0.354034       NaN
two   A       NaN -1.085876
      B -0.624639       NaN
      C       NaN  0.660894